app/views/microposts/_microposts.html.erb

<% if @user.microposts.any? %>
---
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 3